Repository: CofficLab/Lumi
Catalog: Plugins/ModelSelectorPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

# %@ · %@ tokens (in %@ / out %@)
source: %1$@ · %2$@ tokens (in %3$@ / out %4$@)
zh_hans: %1$@ · %2$@ tokens（输入 %3$@ / 输出 %4$@）
zh_hk: %1$@ · %2$@ tokens（輸入 %3$@ / 輸出 %4$@）

# %@, total %@ tokens, peak %@
source: %1$@, total %2$@ tokens, peak %3$@
zh_hans: %1$@，共 %2$@ tokens，峰值 %3$@
zh_hk: %1$@，共 %2$@ tokens，峰值 %3$@

source: %lld models
zh_hans: %lld 个模型
zh_hk: %lld 個模型

source: Active
zh_hans: 当前
zh_hk: 目前

source: All
zh_hans: 全部
zh_hk: 全部

source: Auto
zh_hans: 自动
zh_hk: 自動

source: Auto · Router
zh_hans: 自动 · 路由
zh_hk: 自動 · 路由

source: Availability
zh_hans: 可用性
zh_hk: 可用性

source: Availability has not been checked
zh_hans: 尚未检查可用性
zh_hk: 尚未檢查可用性

source: Availability is inferred from local chat history and provider registration. Use the Current tab to pick a model manually, or enable Auto routing.
zh_hans: 可用性根据本地聊天记录和服务商注册信息推断。可在「当前」标签页手动选择模型，或启用自动路由。
zh_hk: 可用性根據本地聊天記錄和服務商註冊資訊推斷。可在「目前」標籤頁手動選擇模型，或啟用自動路由。

source: Available
zh_hans: 可用
zh_hk: 可用

# Average TPS: %@ (%lld samples)
source: Average TPS: %1$@ (%2$lld samples)
zh_hans: 平均 TPS：%1$@（%2$lld 次采样）
zh_hk: 平均 TPS：%1$@（%2$lld 次採樣）

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Checking
zh_hans: 检查中
zh_hk: 檢查中

source: Checking availability…
zh_hans: 正在检查可用性…
zh_hk: 正在檢查可用性…

source: Checking provider availability
zh_hans: 正在检查服务商可用性
zh_hk: 正在檢查服務商可用性

source: Checking...
zh_hans: 检查中...
zh_hk: 檢查中...

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Current Provider
zh_hans: 当前服务商
zh_hk: 目前服務商

source: Current selected provider
zh_hans: 当前选中的服务商
zh_hk: 目前選取的服務商

source: Enable automatic routing
zh_hans: 启用自动路由
zh_hk: 啟用自動路由

source: Fast
zh_hans: 快速
zh_hk: 快速

source: Fast Models
zh_hans: 较快模型
zh_hk: 較快模型

source: Frequent
zh_hans: 常用
zh_hk: 常用

source: Frequent Models
zh_hans: 常用模型
zh_hk: 常用模型

source: HTTP Response Details
zh_hans: HTTP 响应详情
zh_hk: HTTP 回應詳情

source: HTTP Status
zh_hans: HTTP 状态
zh_hk: HTTP 狀態

source: Idle
zh_hans: 空闲
zh_hk: 閒置

source: Image
zh_hans: 图像
zh_hk: 圖像

source: In Use
zh_hans: 使用中
zh_hk: 使用中

source: last %lld days
zh_hans: 最近 %lld 天
zh_hk: 最近 %lld 天

source: Loading provider information…
zh_hans: 正在加载服务商信息…
zh_hk: 正在載入服務商資訊…

source: Local Placeholder
zh_hans: 未选择
zh_hk: 未選擇

source: Lumi will choose a provider and model based on tools, message size, and availability.
zh_hans: Lumi 将根据工具、消息大小和可用性自动选择服务商和模型。
zh_hk: Lumi 將根據工具、訊息大小和可用性自動選擇服務商和模型。

source: Model Selector
zh_hans: 模型选择器
zh_hk: 模型選擇器

source: Models with higher TPS will appear here
zh_hans: TPS 较高的模型会显示在这里
zh_hk: TPS 較高的模型會顯示在這裡

source: No Fast Models
zh_hans: 暂无较快模型
zh_hk: 暫無較快模型

source: No LLM providers configured
zh_hans: 未配置 LLM 服务商
zh_hk: 未設定 LLM 服務商

source: No Matching Models
zh_hans: 没有匹配的模型
zh_hk: 沒有符合的模型

source: No Model Selected
zh_hans: 未选择模型
zh_hk: 未選擇模型

source: No Provider Selected
zh_hans: 未选择服务商
zh_hk: 未選擇服務商

source: No Providers
zh_hans: 暂无服务商
zh_hk: 暫無服務商

source: No providers found
zh_hans: 未找到服务商
zh_hk: 未找到服務商

source: No Usage History
zh_hans: 暂无使用记录
zh_hk: 暫無使用記錄

source: Other
zh_hans: 其他
zh_hk: 其他

source: peak %@
zh_hans: 峰值 %@
zh_hk: 峰值 %@

source: Please add LLM providers in Settings to enable AI features.
zh_hans: 请在设置中添加 LLM 服务商以启用 AI 功能。
zh_hk: 請在設定中新增 LLM 服務商以啟用 AI 功能。

source: Provider has available models
zh_hans: 服务商有可用模型
zh_hk: 服務商有可用模型

source: Provider has no available models
zh_hans: 服务商没有可用模型
zh_hk: 服務商沒有可用模型

source: Providers
zh_hans: 服务商
zh_hk: 服務商

source: Recently Used
zh_hans: 最近使用
zh_hk: 最近使用

source: Recheck this provider
zh_hans: 重新检查此服务商
zh_hk: 重新檢查此服務商

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Registered Providers
zh_hans: 已注册服务商
zh_hk: 已註冊服務商

source: Response Body
zh_hans: 响应体
zh_hk: 回應內容

source: Response Time
zh_hans: 响应时间
zh_hk: 回應時間

source: Response Time Help
zh_hans: 响应时间说明
zh_hk: 回應時間說明

source: Search Models
zh_hans: 搜索模型
zh_hk: 搜尋模型

source: Search models or providers...
zh_hans: 搜索模型或服务商...
zh_hk: 搜尋模型或服務商...

source: Search providers or models…
zh_hans: 搜索服务商或模型…
zh_hk: 搜尋服務商或模型…

source: Select LLM provider and model
zh_hans: 选择 LLM 服务商和模型
zh_hk: 選擇 LLM 服務商和模型

source: Select Model
zh_hans: 选择模型
zh_hk: 選擇模型

source: Select Model Hint
zh_hans: 选择模型提示
zh_hk: 選擇模型提示

source: Show HTTP response details
zh_hans: 查看 HTTP 响应详情
zh_hk: 查看 HTTP 回應詳情

source: Switch Model
zh_hans: 切换模型
zh_hk: 切換模型

source: Text
zh_hans: 文本
zh_hk: 文字

source: Tools
zh_hans: 工具
zh_hk: 工具

source: Total
zh_hans: 总计
zh_hk: 總計

source: TTFT Help
zh_hans: 首字延迟说明
zh_hk: 首字延遲說明

source: TTS
zh_hans: 语音合成
zh_hk: 語音合成

source: Unavailable
zh_hans: 不可用
zh_hk: 不可用

source: Unknown
zh_hans: 未知
zh_hk: 未知

source: Usage Signals
zh_hans: 使用信号
zh_hk: 使用訊號

# 最近一次路由
source: Last Route
zh_hans: 最近一次路由
zh_hk: 最近一次路由

# 切换模型
source: Switch Model
zh_hans: 切换模型
zh_hk: 切換模型

# 启用 Auto 模型路由
source: Enable Auto Model Routing
zh_hans: 启用 Auto 模型路由
zh_hk: 啟用 Auto 模型路由

# 当前为基础路由版本：不可用模型会被排除，已检测可用模型优先；未检测模型仍可作为候选。
source: Basic routing: unavailable models are excluded, verified models are preferred; untested models remain as candidates.
zh_hans: 当前为基础路由版本：不可用模型会被排除，已检测可用模型优先；未检测模型仍可作为候选。
zh_hk: 目前為基礎路由版本：不可用模型會被排除，已偵測可用模型優先；未偵測模型仍可作為候選。

# 根据消息内容、工具需求、模型能力和可用性自动选择模型。
source: Automatically select a model based on message content, tool requirements, model capabilities, and availability.
zh_hans: 根据消息内容、工具需求、模型能力和可用性自动选择模型。
zh_hk: 根據訊息內容、工具需求、模型能力和可用性自動選擇模型。
